from BrandrdXMusic import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]
        ####
        
SHAYRI = [" 🌺**உன்னை சித்திரவதை செய்துவிட்டு அன்புடன் ஆறுதல் கூறுவது மிகவும் நன்றாக இருக்கிறது.**🌺 \n\n**🥀உன்னை சித்திரவதை செய்துவிட்டு அன்புடன் ஆறுதல் கூறுவது மிகவும் நன்றாக இருக்கிறது.🥀** ",
 " 🌺**என் வாழ்க்கை என் உயிர், என் அமைதியின் இரண்டாவது பெயர் நீ.**🌺 \n\n**🥀மேரி வாழ்க்கை என் வாழ்க்கை, நீ என் அமைதியின் இரண்டாவது பெயர்.🥀** ",
 " 🌺 **யார் இல்லாமல் நீங்கள் என் மகிழ்ச்சி, என் மகிழ்ச்சி அனைத்தும் முழுமையடையாது. **🌺 \n\n**🥀** யார் இல்லாமல் நீங்கள் என் மகிழ்ச்சி, என் மகிழ்ச்சி முழுமையடையாது.🥀** " ,
 " 🌺 **நீ என்னோடு ஏழு ரவுண்டு கட்டிப்போடும் அந்த நாள் சீக்கிரம் வரணும்னு ஆசைப்படுறேன். **🌺 \n\n**🥀ஏழு ரவுண்டுல நீ என்னை கட்டிக்கற அந்த நாள் சீக்கிரம் வரணும்னு ஆசைப்படுறேன்.🥀** ",
 " 🌺**என் இதயத்தின் மீது உன் கையை வைத்து, உன் இதயத்தை என் பெயரில் வை.**🌺 \n\n**🥀உன் கையை என் இதயத்தின் மீது வைத்து, உன் இதயத்தை என் பெயரில் வை.🥀** ",
 " 🌺**மகாதேவ், எந்த காரும், எந்த பங்களாவும் தேவையில்லை, என் காதல் பாதுகாப்பாக உள்ளது, இந்த பிரார்த்தனை மட்டுமே தேவை. இங்கே, இந்த ஆசீர்வாதங்கள் மட்டுமே தேவை.🥀* * ",
 " 🌺 ** நீ மட்டும் தான் என் காதல் என்று கவலைப்படுவாய். ** 🌺 \n\n ** 🥀 நீ மட்டும் தான் என் காதல் என்று கவலை படும். 🥀 ** ",
 "🌺**கேளு கண்ணா, நீ சமயலறையை மட்டும் பார்த்துக்கோ, உன்னைப் பார்த்துக் கொள்ள நான் வந்திருக்கிறேன்.**🌺\n\n**🥀கேள் செல்லம், நீ சமையல் அறையை மட்டும் கவனித்துக்கொள், நான் எடுத்துச் செல்ல இங்கே இருக்கிறேன். உன்னைக் கவனித்துக்கொள்.🥀** " ,
 " 🌺**நூறில் ஒன்று, எனக்கு உங்கள் நிறுவனம் வேண்டும்.**🌺 \n\n**🥀எனவே நூற்றில் ஒன்று, எனக்கு உங்கள் நிறுவனம் வேண்டும்.🥀** ",
 " 🌺 **நிறைய கஷ்டங்களோடு உன்னை கண்டுபிடித்தேன், இப்போது உன்னை இழக்க விரும்பவில்லை, நான் உன்னுடையவனாக இருந்தேன், இப்போது நான் வேறு யாருக்கும் சொந்தமாக விரும்பவில்லை. **🌺 \n\n** 🥀நான் உன்னை மிகவும் சிரமத்துடன் கண்டுபிடித்தேன், இப்போது நான் உன்னை இழக்க விரும்பவில்லை, நான் யாருடனும் இருக்க விரும்பவில்லை.
 " 🌺**குழந்தை, தினமும் பேசுவோம், இன்று ரொமான்ஸ் செய்வோம்.**🌺\n\n**🥀குழந்தை, தினமும் பேசுவோம், இன்று ரொமான்ஸ் செய்வோம்..🥀** ",
 "🌺**நாங்கள் காலையிலும் மாலையிலும் உங்களை நினைவில் கொள்கிறோம், நாங்கள் உன்னை எவ்வளவு நேசிக்கிறோம் என்பதை வேறு என்ன சொல்ல முடியும்.**🌺 \n\n**🥀நாங்கள் காலையிலும் மாலையிலும் உங்களை நினைவில் கொள்கிறோம், இதைப் பற்றி நாங்கள் வேறு என்ன சொல்ல முடியும். நாங்கள் உன்னை எவ்வளவு நேசிக்கிறோம் 🥀** ",
 " 🌺 **ஒருவரைக் காதலிப்பதைக் காதல் என்று சொல்வதில்லை. இதயம் உணராதவன் காதல் எனப்படும். **🌺 \n\n** hai.🥀** ",
 " 🌺 **என் இதயப் பூட்டின் திறவுகோல் நீ, நான் உன்னிடம் என்ன சொல்ல செல்லம், என் வாழ்க்கைக்கு நீ மட்டுமே காரணம். **🌺 \n\n**🥀என் பூட்டின் சாவி நீ இதயம், நான் உனக்கு என்ன சொல்ல வேண்டும் அன்பே, நீ மட்டுமே என் வாழ்க்கையின் முகம்..🥀** ",
 "🌺**உன்னைப் பற்றிய அனைத்தையும் நேசிப்போம், உன்னைப் பற்றிய அனைத்தையும் நம்புவோம், நீ என்னுடையவன் என்று ஒருமுறை சொல்லு, வாழ்நாள் முழுவதும் உனக்காகக் காத்திருப்போம்.**🌺 \n\n**🥀 நாங்கள் ஒவ்வொருவரையும் நேசிப்போம் உன்னுடையது, உன்னுடைய ஒவ்வொரு விஷயத்திற்கும் மதிப்பளிப்போம், நீ என்னுடையவன் மட்டுமே என்று ஒருமுறை சொல்லுங்கள், வாழ்நாள் முழுவதும் உனக்காக காத்திருப்போம்..🥀** ",
 " 🌺**சிறப்பானவர்களிடம் காதல் ஒருபோதும் நிகழாது, யார் காதலில் விழுகிறாரோ அவர் ஸ்பெஷலாக மாறுகிறார்.**🌺 \n\n**🥀காதல் என்பது சிறப்புடையவர்களிடம் நிகழ்வதில்லை, யார் காதலில் விழுகிறாரோ அவர் ஸ்பெஷல் ஆகிறார்.🥀* *",
 "🌺**நீ தான் என் உயிர், அதில் எந்த சந்தேகமும் இல்லை, உன்னை தவிர வேறு யாருக்கும் என் மீது எந்த உரிமையும் இல்லை.**🌺 \n\n**🥀நீ தான் என் உயிர், வேறு யாரும் இல்லை என்பதில் சந்தேகமில்லை. உன்னைத் தவிர எனக்கு எந்த உரிமையும் இல்லை .🥀** ",
 " 🌺 **எனது முதல் காதலை அறியமுடியவில்லை,காதல் என்றால் என்னவென்று அடையாளம் காணமுடியவில்லை,எப்போது வேண்டுமானாலும் நெஞ்சில் இருந்து அகற்ற முடியாத அளவிற்கு இதயத்தில் வைத்திருந்தோம்.**🌺 \n\n **🥀 என் முதல் காதல், காதல் என்றால் என்ன என்று தெரியாமல், நான் விரும்பிய போதெல்லாம், அதை என் இதயத்திலிருந்து எடுக்க முடியாத அளவுக்கு என் இதயத்தில் வைத்திருப்பதால்.🥀** ",
 " 🌺 ** அவள் எவ்வளவு செல்லம் என்று எனக்கே தெரியாது, அவள் எனக்கு மிகவும் பிடித்தவள், ஆனால் தூரம் ஒரு பொருட்டல்ல, அவள் நேற்று எங்களுடையவள், இன்றும் எங்களுடையவள். **🌺 \n\n**🥀 நான் அவள் எனக்கு எவ்வளவு பிரியமானவள் என்று கூட தெரியவில்லை, அவள் என் உயிரை விட எனக்கு மிகவும் பிடித்தவள், அவள் நேற்று எங்களுடையவளா அல்லது இன்று நமக்கு அவளா என்பது முக்கியமில்லை.🥀** ",
 " 🌺 ** ரகசியமாய் வந்து என் இதயத்தில் நுழைகிறாய் , என் சுவாசத்தில் என் நறுமணமாக நீயே , இப்படித்தான் உன் காதல் மந்திரம் வேலை செய்தது , உறங்கும்போதும் விழித்தபோதும் உன்னை மட்டுமே காண்கிறேன் ** 🌺 \n \n* *🥀இந்த வடிவில் மௌனமாக என் இதயத்தில் நுழைகிறாய், அதே போல என் நறுமணம் கரைகளை நிரப்புகிறாய், நீ என் அன்பின் மந்திரத்தை பரப்புகிறாய், தூங்கும்போது என்னைப் பார்க்கிறாய்..🥀** ",
 " 🌺 ** காதலிக்கக் கற்றுக் கொண்டாய், வெறுப்புக்கு இடமில்லை, இந்த இதயத்தில் நீ மட்டுமே இருக்கிறாய், வேறு யாரும் இல்லை. ** 🌺 \n\n ** 🥀 நேசிக்கக் கற்றுக் கொண்டேன், அதற்கு இடமில்லை. வெறுப்பு, நீ மட்டும் தான் என் இதயத்தில் வேறு யாரும் இல்லை.🥀** ",
 "🌺**உங்கள் மகிழ்ச்சியை கடவுளிடம் கேட்கிறோம், எங்கள் பிரார்த்தனையில் உங்கள் சிரிப்பை கேட்கிறோம், உங்களிடம் என்ன கேட்பது என்று ஆச்சரியப்படுகிறோம், வாழ்நாள் முழுவதும் உங்கள் அன்பை கேட்போம்.**🌺\n\n**🥀 நான் உங்கள் மகிழ்ச்சியை கடவுளிடம் கேட்கிறேன், உங்கள் சிரிப்பு எனக்கு வேண்டும், உங்களுக்கு என்ன வேண்டும் என்று நான் ஆச்சரியப்படுகிறேன், உங்கள் வாழ்க்கையின் அன்பு எனக்கு வேண்டும்..🥀** ",
 " 🌺 **என் உதடுகள் உன் உதடுகளைத் தொட வேண்டும் என்று நான் விரும்புகிறேன், உன் முகம் மட்டுமே காணப்பட வேண்டும் என்று நான் விரும்புகிறேன், நம் இதயங்களும் நம் உதடுகளுடன் இணைந்திருக்கும் வகையில் எங்கள் உறவு இருக்க வேண்டும். **🌺\n\n**🥀kash mere hoth tere hontho நான் உன் முகத்தைப் பார்க்கும்போது, ​​என் உறவு மிகவும் எளிதாகி, என் இதயமும் உன்னுடன் மகிழ்ச்சி அடைகிறது.🥀** ",
 " 🌺**இன்று இதை உன்னிடம் சொல்ல என்னை அனுமதி, இந்த மாலையை அலங்கரிக்க என்னை அனுமதி, உன் அன்பில் என்னை சிறைபிடி, இன்று உனக்காக என் உயிரை தியாகம் செய்ய என்னை அனுமதி.**🌺\n\n** 🥀தயவுசெய்து என்னை அனுமதிக்கவும் இன்று இதை உன்னிடம் சொல், இன்று இந்த அவமானத்தை உங்களுடன் பகிர்ந்து கொள்ள என்னை அனுமதியுங்கள், உங்கள் அன்பில் என் உயிரை உங்களிடம் திருப்பித் தர எனக்கு அனுமதியுங்கள்..🥀** ",
 "🌺**காதலுக்கு மக்கள் என்ன பெயர் வைப்பார்கள் என்பதை அறிந்து கொள்ளுங்கள், உங்கள் பெயரை நாங்கள் காதல் என்று அழைக்கிறோம்.**🌺\n\n**🥀ஜேன் மக்களே அன்பிற்கு என்ன பெயர்களை அழைக்கிறோம், உங்கள் பெயரை நாங்கள் காதல் என்று அழைக்கிறோம். நான் சொல்கிறேன்.. .🥀** ",
 " 🌺**நம்மைக் கண்டால் தலை குனிகிறார்கள். எங்களை அழைத்துக் கூட்டத்தில் திருடுகிறார்கள். அவர்கள் நம்மை வெறுத்தாலும் பரவாயில்லை. ஆனால் தெரியாதவர்களைச் சந்தித்து எங்கள் இதயங்களை ஏன் எரிக்கிறீர்கள்.**🌺\n\n\ n**🥀தேக் ",
 " 🌺 **நீ இல்லாமல் பிரிவேன், உன்னை சந்தித்தால் மலராக மலருவேன், உன்னை காணவில்லையென்றால், உயிருடன் இருக்கும்போதே சாவேன், உன்னைக் கண்டால், இறந்தாலும் வாழ்வேன். **🌺\n\n* *"
 " 🌺**சனம், உன் மகிழ்ச்சிக்கு நான் எப்படித் தேவையோ, என் வாழ்க்கைக்கு நீயும் அவசியம். , நீங்கள் என் வாழ்க்கையில் அவசியம்.🥀** ",
 "🌺**உன் கோபத்தால் நான் காதலித்தேன். இந்த கொடூர உலகில் என்னை முழு உரிமையுடன் மிரட்டிய ஒருவன் இருக்கிறான்.**🌺\n\n**🥀உன் சிறிய கோபத்தில் நான் காதலித்தேன். யார் தூய உண்மை என்று என்னை மிரட்டினார்.🥀** ",
 "🌺**கண்கள் இமைகளால் பாதுகாக்கப்படுகின்றன, இதயத் துடிப்பு இதயத்தின் நம்பிக்கை, இந்த உறவும் மிகவும் இனிமையானது, சில நேரங்களில் ஆசை மற்றும் சில நேரங்களில் புகார் உள்ளது.**🌺\n\n**🥀கண்கள் கண் இமைகளால் பாதுகாக்கப்படுகின்றன. , இதயத்துடிப்பு இதயத்தில் நம்பிக்கை உள்ளது, இந்த உறவும் மிகவும் இனிமையானது, சில நேரங்களில் அது நேசிக்கப்படுகிறது, சில சமயங்களில் கற்பிக்கப்படுகிறது.🥀** ",
 "🌺**அன்பைக் கடவுளாகக் கருதும் போது நேசிப்பவனை ஏன் கெட்டவனாகக் கருதுகிறார்கள். உலகமே கல் இதயமாக இருக்கும் போது. பிறகு ஏன் கல்லை வேண்டிக்கொள்கிறார்கள்.**🌺\n\n**🥀 Muhabbt Ko Hab Log கடவுள் அக்கறை காட்டுகிறார், தம்மை நேசிப்பவர்களுக்காக அவர் ஏன் கவலைப்படுகிறார், உலகம் ஒரு கல் இதயமாக இருக்கும்போது, ​​​​மக்கள் ஏன் கல்லிலிருந்து பிரார்த்தனை செய்கிறார்கள்.🥀** ",
 " 🌺**காதலின் உணர்வை உணர்ந்து அன்று முழுவதும் எங்கள் அருகில் அழுதுகொண்டே இருந்தான்.நாங்களும் சுயநல நண்பர்களாக மாறியதால் கவசம் போட்டு கண்ணை மூடிக்கொண்டு தூங்கினோம்.**🌺\n \n**🥀அந்த நாள் முழுவதும் அவன் நம்மைக் கடந்து சென்றதால், அந்த அன்பின் உணர்வை நாங்கள் உணர்ந்தபோது, ​​நாங்களும் இந்த பையனின் விருப்பத்தை எடுத்துக்கொண்டு கண்களை மூடிக்கொண்டு தூங்கினோம்.
 "🌺**இதயத்தின் மூலையில் இருந்து ஒரு குரல் வருகிறது. ஒவ்வொரு நொடியும் அவர்களை மிஸ் செய்கிறோம். நாம் அவர்களை மிஸ் செய்யும் அளவுக்கு அவர்களும் நம்மை மிஸ் செய்கிறார்களா என்று இதயம் மீண்டும் மீண்டும் கேட்கிறது.**🌺\n\n **🥀ஒரு குரல் வருகிறது. இதயத்தின் மூலையில் இருந்து, ஒவ்வொரு நொடியும் உன்னை நினைவில் கொள்கிறோம், இதயம் எங்களிடம் மீண்டும் மீண்டும் கேட்கிறது, நாங்கள் உன்னை நினைவில் வைத்திருக்கும் அளவுக்கு, நீங்களும் எங்களை நினைவில் வைத்திருக்கிறீர்களா,🥀** ",
 " 🌺 ** சில நேரங்களில் வார்த்தைகளை மறந்து விடுகிறேன், சில சமயம் விஷயங்களை மறந்து விடுகிறேன், என் ஜாதியை மறக்கும் அளவுக்கு உன்னை நேசிக்கிறேன், சில சமயம் நான் எழுந்து உன்னை விட்டு விலகும்போது, ​​வெளியேறும்போது, ​​​​உன் அருகில் என்னை மறந்து விடுகிறேன். **🌺\n \n ** ",
 " 🌺**கண்ணாடியில் பார்த்தால் என்னை ஞாபகம் வரும் என் நண்பனை உனக்கு நினைவிருக்கிறது.🥀** ",
 " 🌺**நான் காதலித்த போது அவர்களின் காதலை பார்த்தேன்.வலியை உணர்ந்த போது இமைகள் நிரம்பின.இரு இதயங்களின் துடிப்பில் ஒன்றை கண்டேன்.ஆனால் இந்த இதயத்தின் ஓசை அவர்களின் துடிப்பில் வந்தது.**🌺\n \n**🥀பியார் கியா உன் அன்பின் பார்வைக்கு, வலித்தது, உன் இமைகளின் பாரத்துக்கு, உன் இதயத்தின் பார்வைக்கு, இதயத்தின் ஓசைக்கு, உன் இதயத்தின் ஒலிக்கு.🥀** ",
 "🌺**இங்கு மக்கள் பல முகங்களுடன் வாழ்கிறார்கள், ஒரே ஒரு முகத்தை மட்டுமே விரும்புகிறோம், இந்த முகத்தை மறைக்காதீர்கள், ஏனென்றால் நாங்கள் பார்த்த பிறகுதான் வாழ்கிறோம்.**🌺\n\n**🥀 இங்கு எத்தனை முகங்கள் வாழ்கின்றன? நாங்கள் முகங்களை மட்டுமே விரும்புகிறோம், அவற்றை முத்தமிடுவதில்லை, ஏனென்றால் அவற்றைப் பார்த்து வாழ்கிறோம்.🥀** ",
 " 🌺**எல்லோருடைய bf க்கும் அவரவர் gf யிடம் பேசினால் தூக்கம் வரும், என்னுடையது என்னுடன் சண்டையிடாமல் தூங்க முடியாது தூக்கம் இல்லாமல் 🥀** ",
 " 🌺**உண்மையான அன்பு யாருக்காவது எங்கே? இந்த உலகில் யாருக்காவது இப்படிப்பட்ட காதல் எங்கே இருக்கிறது.**🌺\n\n**🥀உண்மையான காதல் எங்கே? இந்த உலகில் யாருக்காவது இந்த காதல் எங்கே? யாராவது இருக்கிறார்களா? என்னில் அதிர்ஷ்டசாலி.🥀** "]

# Command
    


@app.on_message(filters.command(["shayari" ], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("𝐓𝐡𝐢𝐬 𝐂𝐨𝐦𝐦𝐚𝐧𝐝 𝐎𝐧𝐥𝐲 𝐅𝐨𝐫 𝐆𝐫𝐨𝐮𝐩𝐬.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 . ")

    if message.reply_to_message and message.text:
        return await message.reply("/shayaril  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/shayari  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ...")
    else:
        return await message.reply("/shayari  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ..")
    if chat_id in spam_chats:
        return await message.reply("𝐏𝐥𝐞𝐚𝐬𝐞 𝐀𝐭 𝐅𝐢𝐫𝐬𝐭 𝐒𝐭𝐨𝐩 𝐑𝐮𝐧𝐧𝐢𝐧𝐠 𝐏𝐫𝐨𝐜𝐞𝐬𝐬 ...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += "<a href='tg://user?id={}'>{}</a>".format(usr.user.id, usr.user.first_name)

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(SHAYRI)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass


#

@app.on_message(filters.command(["cancelshayari", "shayarioff"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("𝐂𝐮𝐫𝐫𝐞𝐧𝐭𝐥𝐲 𝐈'𝐦 𝐍𝐨𝐭 ..")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 𝐓𝐚𝐠 𝐌𝐞𝐦𝐛𝐞𝐫𝐬.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("👣 𝐁𝐑𝐀𝐍𝐃𝐄𝐃 𝐒𝐇𝐀𝐘𝐀𝐑𝐈 𝐏𝐑𝐎𝐂𝐄𝐒𝐒 𝐒𝐓𝐎𝐏𝐏𝐄𝐃 💗")
